cf/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВорд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыWord</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пролонгация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПролонгацияДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыРасчетовПоДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПретензионныйПорядок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПретензионныйПорядок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсудность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подсудность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьБезЗащиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УровниСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПролонгируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньПредоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/СтадииПодписанияДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтадииПодписанияДоговоров</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтгрузкаПоДоговоруРазрешена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтадияПодписанияДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииПодписанияДоговоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПользователю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/ДоговорыКонтрагентов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ЗапретитьКОтгрузкеНаСервере(ТекДог)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Договор",ТекДог);
	ЗаписьОСостоянииДок = РегистрыСведений.СтадииПодписанияДоговоров.ПолучитьПоследнее(ТекущаяДата(),Отбор);
	
Если ЗаписьОСостоянииДок.ОтгрузкаПоДоговоруРазрешена = Истина Тогда	
		
	МенеджерЗаписи = РегистрыСведений.СтадииПодписанияДоговоров.СоздатьМенеджерЗаписи(); 
	
	МенеджерЗаписи.Период    = ТекущаяДата();
	МенеджерЗаписи.Договор   = ТекДог; 
	МенеджерЗаписи.ОтгрузкаПоДоговоруРазрешена = Ложь; 
	МенеджерЗаписи.СтадияПодписанияДоговора    = ЗаписьОСостоянииДок.СтадияПодписанияДоговора; 
	
	МенеджерЗаписи.Записать(); 
	
КонецЕсли;

   
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьКОтгрузке(Команда)
	
	СсылкаНаТекущийЭлементСправочника = Элементы.Список.ТекущаяСтрока;//.ТекущиеДанные.Ссылка;
    ЗапретитьКОтгрузкеНаСервере(СсылкаНаТекущийЭлементСправочника);
    Элементы.Список.Обновить();
	КонецПроцедуры

&НаСервере
Процедура РазрешитьКОтгрузкеНаСервере(ТекДог)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Договор",ТекДог);
	ЗаписьОСостоянииДок = РегистрыСведений.СтадииПодписанияДоговоров.ПолучитьПоследнее(ТекущаяДата(),Отбор);
	
Если ЗаписьОСостоянииДок.ОтгрузкаПоДоговоруРазрешена = Ложь Тогда	
		
	МенеджерЗаписи = РегистрыСведений.СтадииПодписанияДоговоров.СоздатьМенеджерЗаписи(); 
	
	МенеджерЗаписи.Период    = ТекущаяДата();
	МенеджерЗаписи.Договор   = ТекДог; 
	МенеджерЗаписи.ОтгрузкаПоДоговоруРазрешена = Истина; 
	МенеджерЗаписи.СтадияПодписанияДоговора    = ЗаписьОСостоянииДок.СтадияПодписанияДоговора; 
	
	МенеджерЗаписи.Записать(); 
	
КонецЕсли;
    


КонецПроцедуры

&НаКлиенте
Процедура РазрешитьКОтгрузке(Команда)
	
	СсылкаНаТекущийЭлементСправочника = Элементы.Список.ТекущаяСтрока;
	РазрешитьКОтгрузкеНаСервере(СсылкаНаТекущийЭлементСправочника);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры
